# ---
# title: "Описательные статистики"
# author: "Вадим Хайтов, Юта Тамберг, Марина Варфоломеева, Анастасия Лянгузова"
# ---

# # ЧАСТЬ 1. Медиана и квантили.  #############################

# ## Медиана
apples <- (7.3, 9.7, 10.1,  9.5,  8.0,  9.2,  7.9,  9.1)
apples

# Чтобы увидеть медиану, мы должны ранжировать,
# или отсортировать, наш вектор по возрастанию:
(apples)


# В ранжированном ряду медиана расположена так,
# что слева и справа от нее находится равное число
# измерений


# Проверим себя. Найдите медиану с помощью функций R



# ## Медиана устойчива к выбросам
# Создадим вектор с новым значением
apples2 <- c(apples, 68)

# Найдите медиану



# Для сравнения посмотрим на среднее.
mean(apples)
mean(apples2)


# ## Квантили

# Квартили
quantile(x = apples, probs = c(0.25, 0.5, 0.75))


# 5-number summary
quantile(apples)

# Персентили. Напишите функцию для вычисления 10% и 99% персентелей
quantile(apples, probs = c())


# ## Боксплот: 5-number summary на графике
library(ggplot2)
theme_set(theme_bw())

apple_data <- data.frame(diameter = apples)
head(apple_data)

ggplot(data = apple_data) +
  geom_boxplot(aes(x = 'Медиана\nи квантили', y = diameter))



# ## Case study: диатомовые водоросли в желудках фильтраторов. ######
# Самостоятельная работа.

# В морских сообществах встречаются два вида
# фильтраторов, один из которых любит селиться
# прямо на поверхности тела другого.
# *Tegella armifera* это вид-хозяин. Он может жить
# как сам по себе, так и вместе с симбионтом.
# *Loxosomella nordgardi* --- вид-симбионт. Он
# практически никогда не встречается в
# одиночестве.
# Данные: Юта Тамберг

# В файле `diatome_count.csv` даны количества
# диатомовых водорослей в желудках этих животных.
# 2 переменные:
# - вид (sp)
# - число водорослей в желудке (count)
# В переменной sp есть три варианта значений:
# - "host_free" (хозяин без симбионта)
# - "host_symbiont" (хозяин с симбионтом)
# - "symbiont" (симбионт)

diatoms <- read.table()


# ## Все ли правильно открылось?
head(diatoms)
str(diatoms)

# ## Есть ли пропущенные значения?
sum(! complete.cases(diatoms))

# Что это за случаи? Напишите код, который покажет какие из строк датафрейма имеют NA

diatoms[]


# ## Задание 1 --------------------------------------------

# Ваша задача рассчитать 5-number summary для
# количества диатомовых в желудках хозяев и
# симбионтов (всех трех категорий).



# ## Боксплоты в ggplot2




# # ЧАСТЬ 2. Нормальное распределение - первое знакомство #####



# # ЧАСТЬ 3. Среднее и стандартное отклонение #################

# ## Центральная тенденция
# ### Среднее арифметическое

sum(apples) / length(apples)

mean(apples)

# ## Как оценить разброс значений?

# ### Девиата (отклонение)
raw_deviates <- apples - mean(apples)
raw_deviates


# ### Девиаты не годятся как мера разброса
round(sum(raw_deviates))

# ### Сумма квадратов = SS, Sum of Squares

sum(raw_deviates^2)

# ### Как усреднить отклонения от среднего значения?

# ### Дисперсия = MS, Mean Square, Variance
sum(raw_deviates^2) / (length(apples) - 1)

var(apples)

# ### Среднеквадратичное/стандартное отклонение = Standard Deviation
sqrt(sum(raw_deviates^2) / (length(apples) - 1))

sd(apples)

# Код для симуляции выборок из популяции с нормальным распределением.


sd_n <-NULL
sd_n_1 <- NULL

Real_SD <- 10
sample_size <- 5

for(i in 1:1000){
  x <- rnorm(n = sample_size, mean = 10, sd = Real_SD)
  sd_n[i] <- sum((x - mean(x))^2)/(sample_size)
  sd_n_1[i] <- sum((x - mean(x))^2)/(sample_size-1)
}

sd_n_assesment <- data.frame(Type = "n", SD = sqrt(sd_n))

sd_n_1_assesment <- data.frame(Type = "n-1", SD = sqrt(sd_n_1))

sd_all <- rbind(sd_n_assesment, sd_n_1_assesment)

sd_all |>
  ggplot(aes(x = Type, y = SD)) +
  geom_boxplot() +
  geom_hline(yintercept = Real_SD, color = "blue")




# ## Среднее и стандартное отклонение при помощи `stat_summary()`
ggplot(data = apple_data) +
  stat_summary(geom = 'pointrange', fun.data = mean_sdl,
               fun.args = list(mult = 1),
               aes(x = 'Среднее \nи стандартное отклонение', y = diameter))





# ## Как соотносятся способы оценки центра и размаха в выборке? ######
ggplot(data = apple_data) +
  geom_boxplot(aes(x = 'Медиана \nи квантили', y = apples)) +
  stat_summary(geom = 'pointrange', fun.data = mean_sdl,
               fun.args = list(mult = 1),
               aes(x = 'Среднее \nи стандартное отклонение', y = diameter))




# # Нормальное распределение ########################################

# ## Стандартизация (Z-преобразование) ##############################

# Задание 1 -----------------------------------------------------------
# Стандартизуйте вектор 1:5
# Чему после стандартизации будет равно среднее?
# Стандартное отклонение?

# # Проверка на нормальность ########################################

# Создаем искусственный датасет


set.seed(9128)

my_vector <- rnorm(n = 150, mean = 10, sd = 3)






# ## Квантильный график

set.seed(9128)
my_vector <- rnorm(n = 150, mean = 10, sd = 3)
library(car)
qqPlot(my_vector, id = FALSE) # квантильный график



# Строим квантильный график вручную







# Задание 2------------------------------------------------------------
# Выполните по одному эти блоки кода.
# Что вы можете сказать о свойствах распределений,
# изображенных на квантильных графиках?

# Блок 1 ----
library(car)
set.seed(3287447)
x <- c(rnorm(n = 75, mean = 10, sd = 4), rnorm(n = 75, mean = 30, sd = 6))
par(mfrow = c(1, 2))
hist(x, nclass = 30, main = '')
qqPlot(x, id = FALSE)
par(mfrow = c(1, 1))

# Блок 2 ----
set.seed(8921)
x <- rpois(n = 100, lambda = 4)
par(mfrow = c(1, 2))
hist(x , nclass = 30, main = '')
qqPlot(x, id = FALSE)
par(mfrow = c(1, 1))

# Блок 3 ----
set.seed(49199158)
x <- rt(n = 150, df = 6)
par(mfrow = c(1, 2))
hist(x , nclass = 30, main = '')
qqPlot(x, id = FALSE)
par(mfrow = c(1, 1))

# Блок 4 ----
set.seed(1298)
x <- rchisq(n = 150, df = 1)
par(mfrow = c(1, 2))
hist(x, nclass = 30, main = '')
qqPlot(x, id = FALSE)
par(mfrow = c(1, 1))


# Задание 3 -------------------------------------------------------------
# Проверьте при
# помощи квантильного графика, подчиняются ли
# эти переменные нормальному распределению.
#
# - Рост американских женщин (датасет women)
# - Длина чашелистиков у ирисов (датасет iris)
# - Число пойманных рысей в Канаде с 1821 по 1934г. (датасет lynx)



# Если интересны подробности о распределениях, можно посмотреть симуляции, например, здесь
# https://stats.stackexchange.com/questions/101274/how-to-interpret-a-qq-plot


# # Оценка вероятностей при помощи распределений #########################


# ## Пример: Размеры улиток ###############################################
#
# В выборке улиток средний диаметр раковины 5 см со стандартным отклонением 1.5 см.
#
# - Какова вероятность того, что случайно выбранная улитка окажется __меньше 3 см__?
# - Какова вероятность того, что случайно выбранная улитка окажется __больше 6 см__?
# - Какова доля улиток с размером раковины __в пределах 3--6 см__?


# ### Какова вероятность того, что случайно выбранная улитка окажется __меньше 3 см__?

Z_1 <- (3 - 5) / 1.5

pnorm(q = Z_1)

# или то же самое
pnorm(q = 3, mean = 5, sd = 1.5)

# ### Какова вероятность того, что случайно выбранная улитка окажется __больше 6 см__?
1 - pnorm(q = 6, mean = 5, sd = 1.5)

# ### Какова доля улиток с размером раковины __в пределах 3--6 см__?
pnorm(q = 6, mean = 5, sd = 1.5) - pnorm(q = 3, mean = 5, sd = 1.5)


# ## Задание 4 ---------------------------------------------------------
#
# Средний рост 18-летних мужчин в России 174.7 см
# со стандартным отклонением 6.65 см.
# В пилоты берут только людей с ростом от 160 до
# 190 см (по приказу Минтранса).
#
# - Какова вероятность того, что случайно выбранный мужчина окажется __ниже 160 см__?
#
# - Какова вероятность того, что случайно выбранный мужчина окажется  __больше 190 см__?
#
# - Какова доля мужчин, не подходящих по росту в пилоты, т.е. __меньше 160 и больше 190 см__?



# ## Задание 5 ---------------------------------------------------------
#
# Средний рост девушек в 16 лет --- 162.2 см со
# стандартным отклонением 6.0 см.
# В пилоты берут только людей с ростом от 160 до
# 190 см (по приказу Минтранса).
#
# Какой процент девушек подходит по росту в пилоты?


# Задание 6 -------------------------------------------------------------

# Предположим, что вес новорожденных нормально
# распределен со средним значением 3500 г и
# стандартным отклонением 600 г.
# - Какой процент детей рождается с весом больше 3200г.
# - Какой процент детей рождается с весом в пределах 2500-4500г.








